package com.itea.dshymanskyi.Lesson2_07122021;

/*Задача №5
Необходимо, чтобы программа выводила на экран такую последовательность:
7 14 21 28 35 42 49 56 63 70 77 84 91 98 */

public class Homework2_5 {
    public static void main(String[] args) {

        for (int i = 7; i <= 98; i += 7) {
            System.out.print(i + " ");
        }

    }
}
